[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Dump individual process memory with sh on FreeBSD (Local)' (GUID: fa37b633-e097-4415-b2b8-c5bf4c86e423) of technique T1003.007 (OS Credential Dumping: Proc Filesystem). Test Description: Using `/proc/$PID/mem`, where $PID is the target process ID, use shell utilities to\ncopy process memory to an external file so it can be searched or exfiltrated later.\nOn FreeBSD procfs must be mounted.. Command/Steps: sh #{script_path}\nPID=$(pgrep -n -f \\\"#{pid_term}\\\")\nMEM_START=$(head -n 5 /proc/\\\"${PID}\\\"/map | tail -1 | cut -d' ' -f1)\nMEM_STOP=$(head -n 5 /proc/\\\"${P..."
from = "now-9m"
rule_id = "1fadff1a-e479-48bf-9d34-4708db2c7992"
language = "kql"
name = "Atomic Test: T1003.007 - Dump individual process memory with sh on FreeBSD (Local)"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1003.007/T1003.007.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1003.007", "fa37b633-e097-4415-b2b8-c5bf4c86e423", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*PID=$(pgrep*\\\" AND process.command_line : \\\"*MEM_START=$(head*\\\" AND process.command_line : \\\"*/proc/\\\"${PID}\\\"/map*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1003.007"
name = "Dump individual process memory with sh on FreeBSD (Local)"
reference = "https://attack.mitre.org/techniques/T1003/007"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1003/007"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1003/007"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1003/007"


