[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Password Spray all Domain Users' (GUID: 90bc2e54-6c84-47a5-9439-0a2a92b4b175) of technique T1110.003 (Brute Force: Password Spraying). Test Description: CAUTION! Be very careful to not exceed the password lockout threshold for users in the domain by running this test too frequently.\nThis atomic attempts to map the IPC$ share on one of the Domain Controllers using a password of Spring2020 for each user in the %temp%\\\\users.txt list. Any successful authentications will be printed to the screen with a message like \\\"[*] username:password\\\", whereas a failed auth will simply print a period. Use the input arguments to specify your own password to use for the password spray.\nUse the get_prereq_command's to create a list of all domain users in the temp directory called users.txt.\nSee the \\\"Windows FOR Loop Password Spraying Made Easy\\\" blog by @OrOneEqualsOne for more details on how these spray commands work. https://medium.com/walmartlabs/windows-for-loop-password-spraying-made-easy-c8cd4ebb86b5. Command/Steps: @FOR /F %n in (%temp%\\\\users.txt) do @echo | set/p=. & @net use %logonserver%\\\\IPC$ /user:\\\"%userdomain%\\\\%n\\\" \\\"#{password}\\\" 1>NUL 2>&1 && @echo [*] %n:#{p..."
from = "now-9m"
rule_id = "145f91e3-3e8d-409a-ae1d-1d0a45cf7404"
language = "kql"
name = "Atomic Test: T1110.003 - Password Spray all Domain Users"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1110.003/T1110.003.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1110.003", "90bc2e54-6c84-47a5-9439-0a2a92b4b175", "windows",]
type = "query"
query = "(process.name : (\\\"cmd.exe\\\", \\\"cmmon32.exe\\\") OR process.parent.name : (\\\"cmd.exe\\\", \\\"cmmon32.exe\\\")) AND process.command_line : \\\"*@FOR*\\\" AND process.command_line : \\\"*(%temp%\\\\users.txt)*\\\" AND process.command_line : \\\"*@echo*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1110.003"
name = "Password Spray all Domain Users"
reference = "https://attack.mitre.org/techniques/T1110/003"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1110/003"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1110/003"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1110/003"


