[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Remote System Discovery - arp nix' (GUID: acb6b1ff-e2ad-4d64-806c-6c35fe73b951) of technique T1018 (Remote System Discovery). Test Description: Identify remote systems via arp.\n\nUpon successful execution, sh will execute arp to list out the arp cache. Output will be via stdout.. Command/Steps: arp -a | grep -v '^?'\n"
from = "now-9m"
rule_id = "cb2826e5-6745-4b70-bd03-76335ad82e62"
language = "kql"
name = "Atomic Test: T1018 - Remote System Discovery - arp nix"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1018/T1018.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1018", "acb6b1ff-e2ad-4d64-806c-6c35fe73b951", "linux", "macos",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*grep*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1018"
name = "Remote System Discovery - arp nix"
reference = "https://attack.mitre.org/techniques/T1018"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1018"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1018"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1018"


