[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Detect Virtualization Environment using system_profiler' (GUID: e04d2e89-de15-4d90-92f9-a335c7337f0f) of technique T1497.001 (Virtualization/Sandbox Evasion: System Checks). Test Description: system_profiler provides system hardware and software configuration and the Model Identifier should provide the value similar to (sysctl -n hw.model). \nWe should be able to find whether virtualization is enabled by checking whether the Model Identifier does not contain \\\"Mac\\\".. Command/Steps: if [ \\\"$(system_profiler SPHardwareDataType | grep \\\"Model Identifier\\\" | grep -v 'Mac')\\\" != \\\"\\\" ]; then echo 'Virtualization Environment detected'; fi;\n"
from = "now-9m"
rule_id = "81bec2b0-cdb7-467a-870b-e9859ec025fd"
language = "kql"
name = "Atomic Test: T1497.001 - Detect Virtualization Environment using system_profiler"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1497.001/T1497.001.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1497.001", "e04d2e89-de15-4d90-92f9-a335c7337f0f", "macos",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*$(system_profiler*\\\" AND process.command_line : \\\"*SPHardwareDataType*\\\" AND process.command_line : \\\"*grep*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1497.001"
name = "Detect Virtualization Environment using system_profiler"
reference = "https://attack.mitre.org/techniques/T1497/001"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1497/001"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1497/001"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1497/001"


