[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Check if System Integrity Protection is enabled' (GUID: 2b73cd9b-b2fb-4357-b9d7-c73c41d9e945) of technique T1497.001 (Virtualization/Sandbox Evasion: System Checks). Test Description: The latest versions of macOS have the System Integrity Protection feature (SIP). If a sandbox uses a non-signed \nkernel extension for monitoring purposes the, SIP feature must be disabled to load this kind of kernel extension.\nMalware may check if the SIP is enabled.\nReference: https://evasions.checkpoint.com/src/MacOS/macos.html#sip. Command/Steps: if [ \\\"$(csrutil status | grep -v 'enabled')\\\" != \\\"\\\" ]; then echo 'Possible Virtualization Environment detected'; fi;\n"
from = "now-9m"
rule_id = "d3d2b142-a5ff-4dd1-ad8b-fb8beaa40095"
language = "kql"
name = "Atomic Test: T1497.001 - Check if System Integrity Protection is enabled"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1497.001/T1497.001.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1497.001", "2b73cd9b-b2fb-4357-b9d7-c73c41d9e945", "macos",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*$(csrutil*\\\" AND process.command_line : \\\"*status*\\\" AND process.command_line : \\\"*grep*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1497.001"
name = "Check if System Integrity Protection is enabled"
reference = "https://attack.mitre.org/techniques/T1497/001"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1497/001"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1497/001"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1497/001"


