[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Compressing data using GZip in Python (FreeBSD/Linux)' (GUID: 391f5298-b12d-4636-8482-35d9c17d53a8) of technique T1560.002 (Archive Collected Data: Archive via Library). Test Description: Uses GZip from Python to compress files. Command/Steps: which_python=`which python || which python3`\n$which_python -c \\\"import gzip;input_file=open('#{path_to_input_file}', 'rb');content=input_file.read();in..."
from = "now-9m"
rule_id = "5b0a1b6a-0773-4fb1-87df-9aed2fe059fc"
language = "kql"
name = "Atomic Test: T1560.002 - Compressing data using GZip in Python (FreeBSD/Linux)"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1560.002/T1560.002.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1560.002", "391f5298-b12d-4636-8482-35d9c17d53a8", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*which_python=`which*\\\" AND process.command_line : \\\"*python*\\\" AND process.command_line : \\\"*which*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1560.002"
name = "Compressing data using GZip in Python (FreeBSD/Linux)"
reference = "https://attack.mitre.org/techniques/T1560/002"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1560/002"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1560/002"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1560/002"


