[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'LockBit Black - Modify Group policy settings -cmd' (GUID: 9ab80952-74ee-43da-a98c-1e740a985f28) of technique T1484.001 (Domain Policy Modification: Group Policy Modification). Test Description: An adversary can modify the group policy settings.. Command/Steps: reg add \\\"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\System\\\" /v GroupPolicyRefreshTimeDC /t REG_DWORD /d 0 /f\nreg add \\\"HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\W..."
from = "now-9m"
rule_id = "e40da4a7-8579-4da6-a5a7-3d1689669904"
language = "kql"
name = "Atomic Test: T1484.001 - LockBit Black - Modify Group policy settings -cmd"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1484.001/T1484.001.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1484.001", "9ab80952-74ee-43da-a98c-1e740a985f28", "windows",]
type = "query"
query = "(process.name : (\\\"cmd.exe\\\", \\\"cmmon32.exe\\\") OR process.parent.name : (\\\"cmd.exe\\\", \\\"cmmon32.exe\\\")) AND process.command_line : \\\"*HKLM\\\\SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows\\\\System*\\\" AND process.command_line : \\\"*GroupPolicyRefreshTimeDC*\\\" AND process.command_line : \\\"*REG_DWORD*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1484.001"
name = "LockBit Black - Modify Group policy settings -cmd"
reference = "https://attack.mitre.org/techniques/T1484/001"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1484/001"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1484/001"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1484/001"


