[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Extracting passwords with findstr' (GUID: 0e56bf29-ff49-4ea5-9af4-3b81283fd513) of technique T1552.001 (Unsecured Credentials: Credentials In Files). Test Description: Extracting Credentials from Files. Upon execution, the contents of files that contain the word \\\"password\\\" will be displayed.. Command/Steps: findstr /si pass *.xml *.doc *.txt *.xls\nls -R | select-string -ErrorAction SilentlyContinue -Pattern password\n"
from = "now-9m"
rule_id = "ce41bea9-3ff0-4831-b2b3-44fbdec3bd32"
language = "kql"
name = "Atomic Test: T1552.001 - Extracting passwords with findstr"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1552.001/T1552.001.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1552.001", "0e56bf29-ff49-4ea5-9af4-3b81283fd513", "windows",]
type = "query"
query = "(process.name : (\\\"powershell.exe\\\", \\\"pwsh.exe\\\", \\\"powershell_ise.exe\\\") OR process.parent.name : (\\\"powershell.exe\\\", \\\"pwsh.exe\\\", \\\"powershell_ise.exe\\\")) AND (powershell.script_block_text : \\\"*findstr*\\\" AND powershell.script_block_text : \\\"*pass*\\\" AND powershell.script_block_text : \\\"*.xml*\\\" OR (process.command_line : \\\"*findstr*\\\" AND process.command_line : \\\"*pass*\\\" AND process.command_line : \\\"*.xml*\\\"))"
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1552.001"
name = "Extracting passwords with findstr"
reference = "https://attack.mitre.org/techniques/T1552/001"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1552/001"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1552/001"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1552/001"


