[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Simulate BlackByte Ransomware Print Bombing' (GUID: 6b2903ac-8f36-450d-9ad5-b220e8a2dcb9) of technique T1059.003 (Command and Scripting Interpreter: Windows Command Shell). Test Description: This test attempts to open a file a specified number of times in Wordpad, then prints the contents. \nIt is designed to mimic BlackByte ransomware's print bombing technique, where tree.dll, which contains the ransom note, is opened in Wordpad 75 times and then printed. \nSee https://redcanary.com/blog/blackbyte-ransomware/.. Command/Steps: cmd /c \\\"for /l %x in (1,1,#{max_to_print}) do start wordpad.exe /p #{file_to_print}\\\" | out-null\n"
from = "now-9m"
rule_id = "a8472982-43c7-491b-ae3a-bff2c5a076e4"
language = "kql"
name = "Atomic Test: T1059.003 - Simulate BlackByte Ransomware Print Bombing"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1059.003/T1059.003.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1059.003", "6b2903ac-8f36-450d-9ad5-b220e8a2dcb9", "windows",]
type = "query"
query = "(process.name : (\\\"powershell.exe\\\", \\\"pwsh.exe\\\", \\\"powershell_ise.exe\\\") OR process.parent.name : (\\\"powershell.exe\\\", \\\"pwsh.exe\\\", \\\"powershell_ise.exe\\\")) AND (powershell.script_block_text : \\\"*(1,1,75)*\\\" AND powershell.script_block_text : \\\"*start*\\\" AND powershell.script_block_text : \\\"*wordpad.exe*\\\" OR (process.command_line : \\\"*(1,1,75)*\\\" AND process.command_line : \\\"*start*\\\" AND process.command_line : \\\"*wordpad.exe*\\\"))"
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1059.003"
name = "Simulate BlackByte Ransomware Print Bombing"
reference = "https://attack.mitre.org/techniques/T1059/003"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1059/003"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1059/003"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1059/003"


