[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'DCShadow (Active Directory)' (GUID: 0f4c5eb0-98a0-4496-9c3d-656b4f2bc8f6) of technique T1207 (Rogue Domain Controller). Test Description: Use Mimikatz DCShadow method to simulate behavior of an Active Directory Domain Controller and edit protected attribute.\n\n[DCShadow](https://www.dcshadow.com/)\n[Additional Reference](http://www.labofapenetrationtester.com/2018/04/dcshadow.html)\n\nIt will set the badPwdCount attribute of the target user (user/machine account) to 9999. You can check after with:\nGet-ADObject -LDAPFilter '(samaccountname=<user>)' -Properties badpwdcount | select-object -ExpandProperty badpwdcount\n\nNeed SYSTEM privileges locally (automatically obtained via PsExec, so running as admin is sufficient), and Domain Admin remotely.\nThe easiest is to run elevated and as a Domain Admin user.. Command/Steps: # starting fake DC server, as SYSTEM (required)\n$dc_output_file = \\\"PathToAtomicsFolder\\\\..\\\\ExternalPayloads\\\\art-T1207-mimikatz-DC.log\\\"\nRemove-Item $dc_..."
from = "now-9m"
rule_id = "45e1d072-9bfe-4f06-8d34-caeaa0913275"
language = "kql"
name = "Atomic Test: T1207 - DCShadow (Active Directory)"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1207/T1207.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1207", "0f4c5eb0-98a0-4496-9c3d-656b4f2bc8f6", "windows",]
type = "query"
query = "(process.name : (\\\"powershell.exe\\\", \\\"pwsh.exe\\\", \\\"powershell_ise.exe\\\") OR process.parent.name : (\\\"powershell.exe\\\", \\\"pwsh.exe\\\", \\\"powershell_ise.exe\\\")) AND (powershell.script_block_text : \\\"*starting*\\\" AND powershell.script_block_text : \\\"*fake*\\\" AND powershell.script_block_text : \\\"*server*\\\" OR (process.command_line : \\\"*starting*\\\" AND process.command_line : \\\"*fake*\\\" AND process.command_line : \\\"*server*\\\"))"
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1207"
name = "DCShadow (Active Directory)"
reference = "https://attack.mitre.org/techniques/T1207"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1207"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1207"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1207"


