[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'FreeBSD VM Check via Kernel Modules' (GUID: eefe6a49-d88b-41d8-8fc2-b46822da90d3) of technique T1082 (System Information Discovery). Test Description: Identify virtual machine host kernel modules.. Command/Steps: kldstat | grep -i \\\"vmm\\\"\nkldstat | grep -i \\\"vbox\\\"\n"
from = "now-9m"
rule_id = "a8da3d37-2eb2-4382-8f44-3a69b6106082"
language = "kql"
name = "Atomic Test: T1082 - FreeBSD VM Check via Kernel Modules"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1082/T1082.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1082", "eefe6a49-d88b-41d8-8fc2-b46822da90d3", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*kldstat*\\\" AND process.command_line : \\\"*grep*\\\" AND process.command_line : \\\"*kldstat*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1082"
name = "FreeBSD VM Check via Kernel Modules"
reference = "https://attack.mitre.org/techniques/T1082"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1082"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1082"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1082"


