[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Linux VM Check via Kernel Modules' (GUID: 8057d484-0fae-49a4-8302-4812c4f1e64e) of technique T1082 (System Information Discovery). Test Description: Identify virtual machine guest kernel modules. This technique is used by the Pupy RAT and other malware.. Command/Steps: sudo lsmod | grep -i \\\"vboxsf\\\\|vboxguest\\\"\nsudo lsmod | grep -i \\\"vmw_baloon\\\\|vmxnet\\\"\nsudo lsmod | grep -i \\\"xen-vbd\\\\|xen-vnif\\\"\nsudo lsmod | grep -i \\\"virt..."
from = "now-9m"
rule_id = "1dc81e72-8b55-46b1-b3d5-fb9047ec7d08"
language = "kql"
name = "Atomic Test: T1082 - Linux VM Check via Kernel Modules"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1082/T1082.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1082", "8057d484-0fae-49a4-8302-4812c4f1e64e", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*lsmod*\\\" AND process.command_line : \\\"*grep*\\\" AND process.command_line : \\\"*vboxsf\\\\|vboxguest*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1082"
name = "Linux VM Check via Kernel Modules"
reference = "https://attack.mitre.org/techniques/T1082"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1082"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1082"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1082"


