[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Execute Embedded Script in Image via Steganography' (GUID: 4ff61684-ad91-405c-9fbc-048354ff1d07) of technique T1001.002 (Data Obfuscation via Steganography). Test Description: This atomic test demonstrates the execution of an embedded script in an image file using steganography techniques. The script is first encoded in base64 and then embedded within the pixels of the image. The modified image is created, and the script is extracted and executed on the target system.. Command/Steps: cat \\\"#{script}\\\" | base64 | xxd -p | sed 's/../& /g' | xargs -n1 | xxd -r -p | cat \\\"#{image}\\\" - > \\\"#{evil_image}\\\"; strings \\\"#{evil_image}\\\" | tail -n 1 ..."
from = "now-9m"
rule_id = "ac22e249-daac-4b1e-8977-1480a3725d40"
language = "kql"
name = "Atomic Test: T1001.002 - Execute Embedded Script in Image via Steganography"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1001.002/T1001.002.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1001.002", "4ff61684-ad91-405c-9fbc-048354ff1d07", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*base64*\\\" AND process.command_line : \\\"*s/../&*\\\" AND process.command_line : \\\"*xargs*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1001.002"
name = "Execute Embedded Script in Image via Steganography"
reference = "https://attack.mitre.org/techniques/T1001/002"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1001/002"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1001/002"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1001/002"


