[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'At - Schedule a job' (GUID: 7266d898-ac82-4ec0-97c7-436075d0d08e) of technique T1053.002 (Scheduled Task/Job: At). Test Description: This test submits a command to be run in the future by the `at` daemon.. Command/Steps: echo \\\"#{at_command}\\\" | at #{time_spec}"
from = "now-9m"
rule_id = "68294413-e8bb-45db-835f-22241bb1ce23"
language = "kql"
name = "Atomic Test: T1053.002 - At - Schedule a job"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1053.002/T1053.002.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1053.002", "7266d898-ac82-4ec0-97c7-436075d0d08e", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*Hello*\\\" AND process.command_line : \\\"*from*\\\" AND process.command_line : \\\"*Team*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1053.002"
name = "At - Schedule a job"
reference = "https://attack.mitre.org/techniques/T1053/002"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1053/002"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1053/002"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1053/002"


