[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Windows HideSCAHealth Group Policy Feature' (GUID: a4637291-40b1-4a96-8c82-b28f1d73e54e) of technique T1112 (Modify Registry). Test Description: Modify the registry of the currently logged in user using reg.exe via cmd console to remove security and maintenance icon Group Policy. \nTake note that some Group Policy changes might require a restart to take effect.\nSee how ransomware abuses this technique- https://www.virustotal.com/gui/file/2d7855bf6470aa323edf2949b54ce2a04d9e38770f1322c3d0420c2303178d91/details. Command/Steps: reg add \\\"HKEY_CURRENT_USER\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\" /v HideSCAHealth /t REG_DWORD /d 1 /f\n"
from = "now-9m"
rule_id = "d7a0bcef-60e0-470c-8431-a663b3c5a556"
language = "kql"
name = "Atomic Test: T1112 - Windows HideSCAHealth Group Policy Feature"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1112/T1112.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1112", "a4637291-40b1-4a96-8c82-b28f1d73e54e", "windows",]
type = "query"
query = "(process.name : (\\\"cmd.exe\\\", \\\"cmmon32.exe\\\") OR process.parent.name : (\\\"cmd.exe\\\", \\\"cmmon32.exe\\\")) AND process.command_line : \\\"*HKEY_CURRENT_USER\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer*\\\" AND process.command_line : \\\"*HideSCAHealth*\\\" AND process.command_line : \\\"*REG_DWORD*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1112"
name = "Windows HideSCAHealth Group Policy Feature"
reference = "https://attack.mitre.org/techniques/T1112"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1112"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1112"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1112"


