[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Show if a user account has ever logged in remotely' (GUID: 0f0b6a29-08c3-44ad-a30b-47fd996b2110) of technique T1087.001 (Account Discovery: Local Account). Test Description: Show if a user account has ever logged in remotely. Command/Steps: [ \\\"$(uname)\\\" = 'FreeBSD' ] && cmd=\\\"lastlogin\\\" || cmd=\\\"lastlog\\\" \n$cmd > #{output_file}\ncat #{output_file}\n"
from = "now-9m"
rule_id = "b04be785-ccf2-409e-aeba-db2edf303c8f"
language = "kql"
name = "Atomic Test: T1087.001 - Show if a user account has ever logged in remotely"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1087.001/T1087.001.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1087.001", "0f0b6a29-08c3-44ad-a30b-47fd996b2110", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*$(uname)*\\\" AND process.command_line : \\\"*FreeBSD*\\\" AND process.command_line : \\\"*cmd=\\\"lastlogin*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1087.001"
name = "Show if a user account has ever logged in remotely"
reference = "https://attack.mitre.org/techniques/T1087/001"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1087/001"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1087/001"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1087/001"


