[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Security Software Discovery - ps (Linux)' (GUID: 23b91cd2-c99c-4002-9e41-317c63e024a2) of technique T1518.001 (Software Discovery: Security Software Discovery). Test Description: Methods to identify Security Software on an endpoint\nwhen sucessfully executed, command shell  is going to display AV/Security software it is running.. Command/Steps: ps aux | egrep 'falcond|nessusd|cbagentd|td-agent|packetbeat|filebeat|auditbeat|osqueryd'\n"
from = "now-9m"
rule_id = "5e694c7f-6419-439a-a95b-b0d73be38ef6"
language = "kql"
name = "Atomic Test: T1518.001 - Security Software Discovery - ps (Linux)"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1518.001/T1518.001.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1518.001", "23b91cd2-c99c-4002-9e41-317c63e024a2", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*egrep*\\\" AND process.command_line : \\\"*falcond|nessusd|cbagentd|td-agent|packetbeat|filebeat|auditbeat|osqueryd*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1518.001"
name = "Security Software Discovery - ps (Linux)"
reference = "https://attack.mitre.org/techniques/T1518/001"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1518/001"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1518/001"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1518/001"


