[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Security Software Discovery - Sysmon Service' (GUID: fe613cf3-8009-4446-9a0f-bc78a15b66c9) of technique T1518.001 (Software Discovery: Security Software Discovery). Test Description: Discovery of an installed Sysinternals Sysmon service using driver altitude (even if the name is changed).\n\nwhen sucessfully executed, the test is going to display sysmon driver instance if it is installed.. Command/Steps: fltmc.exe | findstr.exe 385201\n"
from = "now-9m"
rule_id = "464256a5-7369-4c12-b3bc-851e2c819da8"
language = "kql"
name = "Atomic Test: T1518.001 - Security Software Discovery - Sysmon Service"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1518.001/T1518.001.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1518.001", "fe613cf3-8009-4446-9a0f-bc78a15b66c9", "windows",]
type = "query"
query = "(process.name : (\\\"cmd.exe\\\", \\\"cmmon32.exe\\\") OR process.parent.name : (\\\"cmd.exe\\\", \\\"cmmon32.exe\\\")) AND process.command_line : \\\"*fltmc.exe*\\\" AND process.command_line : \\\"*findstr.exe*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1518.001"
name = "Security Software Discovery - Sysmon Service"
reference = "https://attack.mitre.org/techniques/T1518/001"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1518/001"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1518/001"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1518/001"


