[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Security Software Discovery - ps (macOS)' (GUID: ba62ce11-e820-485f-9c17-6f3c857cd840) of technique T1518.001 (Software Discovery: Security Software Discovery). Test Description: Methods to identify Security Software on an endpoint\nwhen sucessfully executed, command shell  is going to display AV/Security software it is running.. Command/Steps: ps aux | egrep 'Little\\\\ Snitch|CbOsxSensorService|falcond|nessusd|santad|CbDefense|td-agent|packetbeat|filebeat|auditbeat|osqueryd|BlockBlock|LuLu'\n"
from = "now-9m"
rule_id = "56c97937-393b-4696-9cad-f81637c3de5b"
language = "kql"
name = "Atomic Test: T1518.001 - Security Software Discovery - ps (macOS)"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1518.001/T1518.001.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1518.001", "ba62ce11-e820-485f-9c17-6f3c857cd840", "macos",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*egrep*\\\" AND process.command_line : \\\"*Little\\\\*\\\" AND process.command_line : \\\"*Snitch|CbOsxSensorService|falcond|nessusd|santad|CbDefense|td-agent|packetbeat|filebeat|auditbeat|osqueryd|BlockBlock|LuLu*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1518.001"
name = "Security Software Discovery - ps (macOS)"
reference = "https://attack.mitre.org/techniques/T1518/001"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1518/001"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1518/001"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1518/001"


