[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Permission Groups Discovery PowerShell (Domain)' (GUID: 6d5d8c96-3d2a-4da9-9d6d-9a9d341899a7) of technique T1069.002 (Permission Groups Discovery: Domain Groups). Test Description: Permission Groups Discovery utilizing PowerShell. This test will display some errors if run on a computer not connected to a domain. Upon execution, domain\ninformation will be displayed.. Command/Steps: get-ADPrincipalGroupMembership #{user} | select name\n"
from = "now-9m"
rule_id = "bd29d5c3-3e85-4f14-bbe5-9d07b5398a75"
language = "kql"
name = "Atomic Test: T1069.002 - Permission Groups Discovery PowerShell (Domain)"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1069.002/T1069.002.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1069.002", "6d5d8c96-3d2a-4da9-9d6d-9a9d341899a7", "windows",]
type = "query"
query = "(process.name : (\\\"powershell.exe\\\", \\\"pwsh.exe\\\", \\\"powershell_ise.exe\\\") OR process.parent.name : (\\\"powershell.exe\\\", \\\"pwsh.exe\\\", \\\"powershell_ise.exe\\\")) AND (powershell.script_block_text : \\\"*get-ADPrincipalGroupMembership*\\\" AND powershell.script_block_text : \\\"*$env:USERNAME*\\\" AND powershell.script_block_text : \\\"*select*\\\" OR (process.command_line : \\\"*get-ADPrincipalGroupMembership*\\\" AND process.command_line : \\\"*$env:USERNAME*\\\" AND process.command_line : \\\"*select*\\\"))"
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1069.002"
name = "Permission Groups Discovery PowerShell (Domain)"
reference = "https://attack.mitre.org/techniques/T1069/002"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1069/002"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1069/002"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1069/002"


