[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Login as nobody (Linux)' (GUID: 3d2cd093-ee05-41bd-a802-59ee5c301b85) of technique T1078.003 (Valid Accounts: Local Accounts). Test Description: An adversary may try to re-purpose a system account to appear legitimate. In this test change the login shell of the nobody account, change its password to nobody, su to nobody, exit, then reset nobody's shell to /usr/sbin/nologin. Here is how the nobody entry should look like in `/etc/passwd` before the test is executed and right after the cleanup: `# -> nobody:x:65534:65534:nobody:/nonexistent:/usr/sbin/nologin`. Command/Steps: cat /etc/passwd |grep nobody\nchsh --shell /bin/bash nobody\nusermod --password $(openssl passwd -1 nobody) nobody\nsu -c \\\"whoami\\\" nobody\n"
from = "now-9m"
rule_id = "5fbc124b-6db1-486f-af85-f947fe8855d7"
language = "kql"
name = "Atomic Test: T1078.003 - Login as nobody (Linux)"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1078.003/T1078.003.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1078.003", "3d2cd093-ee05-41bd-a802-59ee5c301b85", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*/etc/passwd*\\\" AND process.command_line : \\\"*|grep*\\\" AND process.command_line : \\\"*nobody*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1078.003"
name = "Login as nobody (Linux)"
reference = "https://attack.mitre.org/techniques/T1078/003"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1078/003"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1078/003"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1078/003"


