[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Search Through sh History' (GUID: d87d3b94-05b4-40f2-a80f-99864ffa6803) of technique T1552.003 (Unsecured Credentials: Bash History). Test Description: Search through sh history for specifice commands we want to capture. Command/Steps: cat #{sh_history_filename} | grep #{sh_history_grep_args} > #{output_file}\n"
from = "now-9m"
rule_id = "e9aa5c86-28b9-4554-aac2-0de8454ed804"
language = "kql"
name = "Atomic Test: T1552.003 - Search Through sh History"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1552.003/T1552.003.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1552.003", "d87d3b94-05b4-40f2-a80f-99864ffa6803", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*~/.history*\\\" AND process.command_line : \\\"*grep*\\\" AND process.command_line : \\\"*pass*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1552.003"
name = "Search Through sh History"
reference = "https://attack.mitre.org/techniques/T1552/003"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1552/003"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1552/003"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1552/003"


