[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Disable tty_tickets for sudo caching (freebsd)' (GUID: 4df6a0fe-2bdd-4be8-8618-a6a19654a57a) of technique T1548.003 (Abuse Elevation Control Mechanism: Sudo and Sudo Caching). Test Description: Sets sudo caching tty_tickets value to disabled. This is dangerous to modify without using 'visudo', do not do this on a production system.. Command/Steps: sudo sh -c \\\"echo Defaults \\\"'!'\\\"tty_tickets >> /usr/local/etc/sudoers\\\"\nsudo visudo -c -f /usr/local/etc/sudoers\n"
from = "now-9m"
rule_id = "e4a4f79c-67e6-4b17-a2b4-4d9a898dd729"
language = "kql"
name = "Atomic Test: T1548.003 - Disable tty_tickets for sudo caching (freebsd)"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1548.003/T1548.003.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1548.003", "4df6a0fe-2bdd-4be8-8618-a6a19654a57a", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*Defaults*\\\" AND process.command_line : \\\"*!'\\\"tty_tickets*\\\" AND process.command_line : \\\"*/usr/local/etc/sudoers*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1548.003"
name = "Disable tty_tickets for sudo caching (freebsd)"
reference = "https://attack.mitre.org/techniques/T1548/003"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1548/003"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1548/003"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1548/003"


