[rule]
author = [ "AtomicRedTeam-Automation",]
description = "Detection for specific test 'Logging bash history to syslog' (GUID: 0e59d59d-3265-4d35-bebd-bf5c1ec40db5) of technique T1056.001 (Input Capture: Keylogging). Test Description: There are several variables that can be set to control the appearance of the bash command prompt: PS1, PS2, PS3, PS4 and PROMPT_COMMAND. The contents of these variables are executed as if they had been typed on the command line. The PROMPT_COMMAND variable \\\"if set\\\" will be executed before the PS1 variable and can be configured to write the latest \\\"bash history\\\" entries to the syslog.\n\nTo gain persistence the command could be added to the users .bashrc or .bash_aliases or the systems default .bashrc in /etc/skel/. Command/Steps: PROMPT_COMMAND='history -a >(tee -a ~/.bash_history |logger -t \\\"$USER[$$] $SSH_CONNECTION \\\")'\necho \\\"\\\\$PROMPT_COMMAND=$PROMPT_COMMAND\\\"\ntail /var/log/sy..."
from = "now-9m"
rule_id = "7b24cd00-4d69-4cfd-807f-ce8859def5ce"
language = "kql"
name = "Atomic Test: T1056.001 - Logging bash history to syslog"
output_index = ".siem-signals-default"
references = [ "https://raw.githubusercontent.com/redcanaryco/atomic-red-team/refs/heads/master/atomics/T1056.001/T1056.001.yaml",]
risk_score = 50
severity = "medium"
tags = [ "AtomicRedTeam", "T1056.001", "0e59d59d-3265-4d35-bebd-bf5c1ec40db5", "linux",]
type = "query"
query = "(process.name : (\\\"sh\\\", \\\"bash\\\") OR process.parent.name : (\\\"sh\\\", \\\"bash\\\")) AND process.command_line : \\\"*PROMPT_COMMAND='history*\\\" AND process.command_line : \\\"*>(tee*\\\" AND process.command_line : \\\"*~/.bash_history*\\\""
version = 1
index = [ "logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "logs-linux.*", "logs-macos.*",]
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1056.001"
name = "Logging bash history to syslog"
reference = "https://attack.mitre.org/techniques/T1056/001"

[[rule.threat.tactic]]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/techniques/T1056/001"

[[rule.threat.tactic]]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1056/001"

[[rule.threat.tactic]]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/techniques/T1056/001"


